In [1]:
import pandas as pd

In [4]:
employees = {
    "fname" : ["Ana", "John", "Mark"],
    "lname" : ["Connor", "Smith", "Golberg"],
    "yob" : [1988, 1995, 1970],
    "salary": [8888.22, 12345.67, 23456.98],
    "manager": [False, False, True]
}
employees

{'fname': ['Ana', 'John', 'Mark'],
 'lname': ['Connor', 'Smith', 'Golberg'],
 'yob': [1988, 1995, 1970],
 'salary': [8888.22, 12345.67, 23456.98],
 'manager': [False, False, True]}

In [5]:
df = pd.DataFrame(employees)
df

  fname    lname   yob    salary  manager
0   Ana   Connor  1988   8888.22    False
1  John    Smith  1995  12345.67    False
2  Mark  Golberg  1970  23456.98     True

In [8]:
# get information about the columns
df.columns

Index(['fname', 'lname', 'yob', 'salary', 'manager'], dtype='object')

In [9]:
df.columns[2] = "year of birth"

TypeError: Index does not support mutable operations

In [12]:
df.columns = ['fname', 'lname', 'year of birth', 'salary', 'manager']
df

  fname    lname  year of birth    salary  manager
0   Ana   Connor           1988   8888.22    False
1  John    Smith           1995  12345.67    False
2  Mark  Golberg           1970  23456.98     True

In [13]:
# remove one single columns from DataFrame
del(df["salary"])
df

  fname    lname  year of birth  manager
0   Ana   Connor           1988    False
1  John    Smith           1995    False
2  Mark  Golberg           1970     True

In [15]:
# get data from one columns
df["fname"]

0     Ana
1    John
2    Mark
Name: fname, dtype: object

In [17]:
# get data from many columns
df[ ["lname","fname","lname"] ]

     lname fname    lname
0   Connor   Ana   Connor
1    Smith  John    Smith
2  Golberg  Mark  Golberg

In [18]:
# dot notation
df.fname

0     Ana
1    John
2    Mark
Name: fname, dtype: object

In [19]:
df

  fname    lname  year of birth  manager
0   Ana   Connor           1988    False
1  John    Smith           1995    False
2  Mark  Golberg           1970     True

In [21]:
# create a new columns with information about employees age
2023 - df["year of birth"]

0    35
1    28
2    53
Name: year of birth, dtype: int64

In [25]:
from datetime import datetime

In [31]:
df["age"] = datetime.now().year - df["year of birth"]
df

  fname    lname  year of birth  manager  age
0   Ana   Connor           1988    False   35
1  John    Smith           1995    False   28
2  Mark  Golberg           1970     True   53